# Data Cleaning with Pandas

>“Happy families are all alike; every unhappy family is unhappy in its own way.” –– Leo Tolstoy

>“Tidy datasets are all alike, but every messy dataset is messy in its own way.” –– Hadley Wickham

There are three interrelated rules which make a dataset tidy:

1. Each variable must have its own column.
2. Each observation must have its own row.
3. Each value must have its own cell.

![tidy](img/tidy-1.png)

In [1]:
%load_ext autoreload
%autoreload 2

In [2]:
import untidy
import pandas as pd

We have versions of the same dataset below.
- What makes each of these datasets untidy?
- What would the ideal tidy version of this data look like?
- What code would you use to fix each dataset?

In [3]:
untidy1 = untidy.exampleone()

       country  year       obser      count
0  Afghanistan  1999       cases        745
1  Afghanistan  1999  population   19987071
2  Afghanistan  2000       cases       2666
3  Afghanistan  2000  population   20595360
4       Brazil  1999       cases      37737
5       Brazil  1999  population  172006362

In [4]:
unt1Merged = pd.merge(untidy1, untidy1, on=['country', 'year'], how='inner', suffixes=('_cases', '_population'))

In [5]:
unt1Merged.head(3)

,country,year,obser_cases,count_cases,obser_population,count_population
0,Afghanistan,1999,cases,745,cases,745
1,Afghanistan,1999,cases,745,population,19987071
2,Afghanistan,1999,population,19987071,cases,745

In [6]:
unt1Cleaned = unt1Merged.loc[(unt1Merged.obser_cases == 'cases') & (unt1Merged.obser_population == 'population')].copy()

In [7]:
unt1Cleaned.drop(columns=['obser_cases', 'obser_population'], inplace=True)

In [8]:
unt1Cleaned.set_index(['country', 'year'], inplace=True)

In [9]:
unt1Cleaned

                  count_cases  count_population
country     year
Afghanistan 1999          745          19987071
            2000         2666          20595360
Brazil      1999        37737         172006362

In [10]:
untidy2 = untidy.exampletwo()

       country  year               rate
0  Afghanistan  1999       745/19987071
1  Afghanistan  2000      2666/20595360
2       Brazil  1999    37737/172006362
3       Brazil  2000    80488/174504898
4        China  1999  212258/1272915272
5        China  2000  213766/1280428583

In [11]:
counts = untidy2.rate.str.split('/', expand=True)

In [12]:
counts[0]

0       745
1      2666
2     37737
3     80488
4    212258
5    213766
Name: 0, dtype: object

In [13]:
#untidy2['cases'], untidy2['population'] = untidy2.rate.str.split('/').str
untidy2['cases'] = pd.to_numeric(counts[0])

In [14]:
untidy2['population'] = pd.to_numeric(counts[1])

In [15]:
untidy2.rate = untidy2.cases / untidy2.population

In [16]:
untidy2

       country  year      rate   cases  population
0  Afghanistan  1999  0.000037     745    19987071
1  Afghanistan  2000  0.000129    2666    20595360
2       Brazil  1999  0.000219   37737   172006362
3       Brazil  2000  0.000461   80488   174504898
4        China  1999  0.000167  212258  1272915272
5        China  2000  0.000167  213766  1280428583

In [17]:
part1, part2 = untidy.examplethree()

table 1
       country    1999    2000
0  Afghanistan     745    2666
1       Brazil   37737   80488
2        China  212258  213766

table 2
       country        1999        2000
0  Afghanistan    19987071    20595360
1       Brazil   172006362   174504898
2        China  1272915272  1280428583

In [46]:
part1_melted = part1.melt('country', ['1999', '2000'], var_name='year', value_name='cases')

In [47]:
part2_melted = part2.melt('country', ['1999', '2000'], var_name='year', value_name='population')

In [48]:
part1_melted.head(1)

       country  year  cases
0  Afghanistan  1999    745

In [49]:
part2_melted.head(1)

       country  year  population
0  Afghanistan  1999    19987071

In [50]:
part1_melted.set_index(['country', 'year'], inplace=True)

In [51]:
part2_melted.set_index(['country', 'year'], inplace=True)

In [52]:
part1_2_joined = pd.concat([part1_melted, part2_melted], axis=1)

In [53]:
part1_2_joined.head(10)

                   cases  population
country     year
Afghanistan 1999     745    19987071
Brazil      1999   37737   172006362
China       1999  212258  1272915272
Afghanistan 2000    2666    20595360
Brazil      2000   80488   174504898
China       2000  213766  1280428583